tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"

# Library for command-line editing
brew "readline"

# Command-line interface for SQLite
brew "sqlite"

# Cross-platform make
brew "cmake"

# TIFF library and utilities
brew "libtiff"

# Distributed revision control system
brew "git"

# Manage your Java environment
brew "jenv"

# Lightweight and flexible command-line JSON processor
brew "jq"

# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"

# General-purpose lossless data-compression library
brew "zlib"

# Open source relational database management system
brew "mysql"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Python version management
brew "pyenv"

# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"

# Persistent key-value database, with built-in net interface
brew "redis"

# Terminal multiplexer
brew "tmux"

# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"

# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"

# Universal database tool and SQL client
cask "dbeaver-community"

# Voice and text chat software
cask "discord"

# Web browser
cask "firefox"

# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"

